MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/M054ZDN/mcu.h
#define ACMP_SR_ACMPO2_Pos   2                                   /*!< ACMP_T::SR: ACMPO2 Position */
#define ACMP_SR_ACMPO2_Msk   (1ul << ACMP_SR_ACMPO2_Pos)         /*!< ACMP_T::SR: ACMPO2 Mask */

#define ACMP_SR_ACMPF3_Pos   1                                   /*!< ACMP_T::SR: ACMPF3 Position */
#define ACMP_SR_ACMPF3_Msk   (1ul << ACMP_SR_ACMPF3_Pos)         /*!< ACMP_T::SR: ACMPF3 Mask */

#define ACMP_SR_ACMPF2_Pos   0                                   /*!< ACMP_T::SR: ACMPF2 Position */
#define ACMP_SR_ACMPF2_Msk   (1ul << ACMP_SR_ACMPF2_Pos)         /*!< ACMP_T::SR: ACMPF2 Mask */
/**@}*/ /* ACMP_CONST */
/**@}*/ /* ACMP */


/*----------------------------- ADC Controller -------------------------------*/
/** @addtogroup ADC Analog to Digital Converter(ADC)
  Memory Mapped Structure for ADC Controller
  @{
 */

typedef struct
{


/**
 * @var ADC_T::ADDR
 * Offset: 0x00-0x1C  A/D Data Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |RSLT      |A/D Conversion Result
 * |        |          |This field contains 12 bits conversion result.
 * |[16]    |OVERRUN   |Over Run Flag
 * |        |          |1 = Data in RSLT[11:0] is overwrite.
 * |        |          |0 = Data in RSLT[11:0] is recent conversion result.
 * |        |          |If converted data in RSLT[11:0] has not been read before new conversion result is
 * |        |          |loaded to this register, OVERRUN is set to 1. It will be cleared by hardware after
 * |        |          |ADDR register is read.
 * |[17]    |VALID     |Valid Flag
 * |        |          |1 = Data in RSLT[11:0] bits is valid.
 * |        |          |0 = Data in RSLT[11:0] bits is not valid.
 * |        |          |This bit is set to 1 when corresponding channel analog input conversion is completed
 * |        |          |and cleared by hardware after ADDR register is read.
 * @var ADC_T::ADCR
 * Offset: 0x20  A/D Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |ADEN      |A/D Converter Enable
 * |        |          |1 = Enable
 * |        |          |0 = Disable
 * |        |          |Before starting A/D conversion function, this bit should be set to 1. Clear it to 0 to
 * |        |          |disable A/D converter analog circuit for saving power consumption.
 * |[1]     |ADIE      |A/D Interrupt Enable
 * |        |          |1 = Enable A/D interrupt function
 * |        |          |0 = Disable A/D interrupt function
 * |        |          |A/D conversion end interrupt request is generated if ADIE bit is set to 1.
 * |[3:2]   |ADMD      |A/D Converter Operation Mode
 * |        |          |00 = Single conversion
 * |        |          |01 = Burst conversion
 * |        |          |10 = Single-cycle scan
 * |        |          |11 = Continuous scan
 * |        |          |When changing the operation mode, software should disable ADST bit firstly.
 * |        |          |Note: In Burst Mode, the A/D result data always at Data Register 0.
 * |[5:4]   |TRGS      |Hardware Trigger Source
 * |        |          |00 = A/D conversion is started by external STADC pin.
 * |        |          |Others = Reserved
 * |        |          |Software should disable TRGE and ADST before change TRGS.
 * |        |          |In hardware trigger mode, the ADST bit is set by the external trigger from STADC.
 * |[7:6]   |TRGCOND   |External Trigger Condition
 * |        |          |These two bits decide external pin STADC trigger event is level or edge. The signal
 * |        |          |must be kept at stable state at least 8 PCLKs for level trigger and 4 PCLKs at high and
 * |        |          |low state.
 * |        |          |00 = Low level
 * |        |          |01 = High level
 * |        |          |10 = Falling edge
 * |        |          |11 = Rising edge
 * |[8]     |TRGE      |External Trigger Enable
 * |        |          |Enable or disable triggering of A/D conversion by external STADC pin.
 * |        |          |1= Enable
 * |        |          |0= Disable
 * |[10]    |DIFFEN    |A/D Differential Input Mode Enable
 * |        |          |1 = A/D is in differential analog input mode
 * |        |          |0 = A/D is in single-end analog input mode
 * |        |          |Differential input voltage (Vdiff) = Vplus - Vminus
 * |        |          |The Vplus of differential input paired channel 0 is from ADC0 pin; Vminus is from ADC1 pin.
 * |        |          |The Vplus of differential input paired channel 1 is from ADC2 pin; Vminus is from ADC3 pin.
 * |        |          |The Vplus of differential input paired channel 2 is from ADC4 pin; Vminus is from ADC5 pin.
 * |        |          |The Vplus of differential input paired channel 3 is from ADC6 pin; Vminus is from ADC7 pin.
 * |        |          |In differential input mode, only one of the two corresponding channels needs to be
 * |        |          |enabled in ADCHER. The conversion result will be placed to the corresponding data
 * |        |          |register of the enabled channel. If both channels of a differential input paired channel
 * |        |          |are enabled, the ADC will convert it twice in scan mode. And then write the conversion
 * |        |          |result to the two corresponding data registers.
 * |[11]    |ADST      |A/D Conversion Start
 * |        |          |1 = Conversion start.
 * |        |          |0 = Conversion stopped and A/D converter enter idle state.
 * |        |          |ADST bit can be controlled by two sources: software write and external pin STADC.
 * |        |          |ADST is cleared to 0 by hardware automatically at the ends of single mode and single-
 * |        |          |cycle scan mode on specified channels. In continuous scan mode, A/D conversion is
 * |        |          |continuously performed sequentially until this bit is cleared to 0 or chip reset.
 * @var ADC_T::ADCHER
 * Offset: 0x24  A/D Channel Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |CHEN0     |Analog Input Channel 0 Enable
 * |        |          |1 = Enable
 * |        |          |0 = Disable
 * |        |          |This channel is the default enabled channel if CHEN0~7 are set as 0s.
 * |[1]     |CHEN1     |Analog Input Channel 1 Enable
 * |        |          |1 = Enable
 * |        |          |0 = Disable
 * |[2]     |CHEN2     |Analog Input Channel 2 Enable
 * |        |          |1 = Enable
 * |        |          |0 = Disable
 * |[3]     |CHEN3     |Analog Input Channel 3 Enable
 * |        |          |1 = Enable
 * |        |          |0 = Disable
 * |[4]     |CHEN4     |Analog Input Channel 4 Enable
 * |        |          |1 = Enable
 * |        |          |0 = Disable
 * |[5]     |CHEN5     |Analog Input Channel 5 Enable
 * |        |          |1 = Enable
 * |        |          |0 = Disable
 * |[6]     |CHEN6     |Analog Input Channel 6 Enable
 * |        |          |1 = Enable
 * |        |          |0 = Disable
 * |[7]     |CHEN7     |Analog Input Channel 7 Enable
 * |        |          |1 = Enable
 * |        |          |0 = Disable
 * |[9:8]   |PRESEL    |Analog Input Channel 7 select
 * |        |          |00: External analog input
 * |        |          |01: Internal bandgap voltage
 * |        |          |1x: Reserved
 * @var ADC_T::ADCMPR
 * Offset: 0x28,0x2C  A/D Compare Register 0 & 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |CMPEN     |Compare Enable
 * |        |          |1 = Enable compare.
 * |        |          |0 = Disable compare.
 * |        |          |Set this bit to 1 to enable compare CMPD[11:0] with specified channel conversion
 * |        |          |result when converted data is loaded into ADDR register.
 * |[1]     |CMPIE     |Compare Interrupt Enable
 * |        |          |1 = Enable compare function interrupt.
 * |        |          |0 = Disable compare function interrupt.
 * |        |          |If the compare function is enabled and the compare condition matches the settings
 * |        |          |of CMPCOND and CMPMATCNT, CMPF0 bit will be asserted. If CMPIE is set to
 * |        |          |1, a compare interrupt request is generated.
 * |[2]     |CMPCOND   |Compare Condition
 * |        |          |1= Set the compare condition as that when a 12-bit A/D conversion result is
 * |        |          |greater or equal to the 12-bit CMPD(ADCMPR0[27:16]), the internal match
 * |        |          |counter will increase one.
 * |        |          |0= Set the compare condition as that when a 12-bit A/D conversion result is less
 * |        |          |than the 12-bit CMPD(ADCMPR0[27:16]), the internal match counter will
 * |        |          |increase one.
 * |        |          |Note: When the internal counter reaches the value to (CMPMATCNT +1), the
 * |        |          |CMPF0 bit will be set.
 * |[5:3]   |CMPCH     |Compare Channel Selection
 * |        |          |000 = Channel 0 conversion result is selected to be compared.
 * |        |          |001 = Channel 1 conversion result is selected to be compared.
 * |        |          |010 = Channel 2 conversion result is selected to be compared.
 * |        |          |011 = Channel 3 conversion result is selected to be compared.
 * |        |          |100 = Channel 4 conversion result is selected to be compared.
 * |        |          |101 = Channel 5 conversion result is selected to be compared.
 * |        |          |110 = Channel 6 conversion result is selected to be compared.
 * |        |          |111 = Channel 7 conversion result is selected to be compared.
 * |[11:8]  |CMPMATCNT |Compare Match Count
 * |        |          |When the specified A/D channel analog conversion result matches the compare
 * |        |          |condition defined by CMPCOND[2], the internal match counter will increase 1.
 * |        |          |When the internal counter reaches the value to (CMPMATCNT +1), the CMPF0 bit
 * |        |          |will be set.
 * |[27:16] |CMPD      |Comparison Data
 * |        |          |The 12 bits data is used to compare with conversion result of specified channel.
 * |        |          |Software can use it to monitor the external analog input pin voltage transition in
 * |        |          |scan mode without imposing a load on software.
 * @var ADC_T::ADSR
 * Offset: 0x30  ADC Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |ADF       |A/D Conversion End Flag
 * |        |          |A status flag that indicates the end of A/D conversion.
 * |        |          |ADF is set to 1 at these two conditions:
 * |        |          |1.  When A/D conversion ends in single mode
 * |        |          |2.  When A/D conversion ends on all specified channels in scan mode.
 * |        |          |3.  When more than 4 samples in FIFO in Burst mode.
 * |        |          |This bit can be cleared by writing 1 to itself.
 * |[1]     |CMPF0     |Compare Flag
 * |        |          |When the selected channel A/D conversion result meets the setting conditions of
 * |        |          |ADCMPR0 then this bit will be set to 1. And it can be cleared by writing 1 to itself.
 * |        |          |1 = Conversion result in ADDR meets ADCMPR0 setting
 * |        |          |0 = Conversion result in ADDR does not meet ADCMPR0 setting
 * |[2]     |CMPF1     |Compare Flag
 * |        |          |When the selected channel A/D conversion result meets the setting conditions of
 * |        |          |ADCMPR1 then this bit will be set to 1. And it can be cleared by writing 1 to itself.
 * |        |          |1 = Conversion result in ADDR meets ADCMPR1 setting
 * |        |          |0 = Conversion result in ADDR does not meet ADCMPR1 setting
 * |[3]     |BUSY      |BUSY/IDLE
 * |        |          |1 = A/D converter is busy at conversion.
 * |        |          |0 = A/D converter is in idle state.
 * |        |          |This bit is mirror of as ADST bit in ADCR.
 * |        |          |It is read only.
 * |[6:4]   |CHANNEL   |Current Conversion Channel
 * |        |          |This filed reflects current conversion channel when BUSY=1. When BUSY=0, it
 * |        |          |shows the next channel will be converted.
 * |        |          |It is read only.
 * |[15:8]  |VALID     |Data Valid flag
 * |        |          |It is a mirror of VALID bit in ADDRx
 * |        |          |When ADC is in Burst Mode, and there is at least one valid conversion result in buffer,
 * |        |          |VALID[7:0] will all set to 1.
 * |[23:16] |OVERRUN   |Over Run flag
 * |        |          |It is a mirror to OVERRUN bit in ADDRx
 * |        |          |When ADC is in Burst Mode, and the buffer is overrun, OVERRUN[7:0] will all set to
 * |        |          |1.
 * @var ADC_T::ADTDCR
 * Offset: 0x30  ADC Trigger Delay Control Register(M05xxDN/DE Only)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |PTDT      |PWM Trigger Delay Time
 * |        |          |Set this field will delay ADC start conversion time after PWM trigger.
 * |        |          |PWM trigger delay time is (4 * PTDT) * system clock
 */

    __I  uint32_t ADDR[8];       /* Offset: 0x00-0x1C  A/D Data Register                                             */
    __IO uint32_t ADCR;          /* Offset: 0x20  A/D Control Register                                               */
    __IO uint32_t ADCHER;        /* Offset: 0x24  A/D Channel Enable Register                                        */
    __IO uint32_t ADCMPR[2];     /* Offset: 0x28,0x2C  A/D Compare Register 0 & 1                                    */
    __IO uint32_t ADSR;          /* Offset: 0x30  ADC Status Register                                                */
    __I  uint32_t RESERVED[4];
    __IO uint32_t ADTDCR;        /* Offset: 0x44  ADC Trigger Delay Control Register(M05xxDN/DE Only)                */
} ADC_T;




/** @addtogroup ADC_CONST ADC Bit Field Definition
  Constant Definitions for ADC Controller
  @{
 */
/* ADDR Bit Field Definitions */
#define ADC_ADDR_VALID_Pos      17                                /*!< ADC_T::ADDR: VALID Position */
#define ADC_ADDR_VALID_Msk      (1ul << ADC_ADDR_VALID_Pos)       /*!< ADC_T::ADDR: VALID Mask */

#define ADC_ADDR_OVERRUN_Pos    16                                /*!< ADC_T::ADDR: OVERRUN Position */
#define ADC_ADDR_OVERRUN_Msk    (1ul << ADC_ADDR_OVERRUN_Pos)     /*!< ADC_T::ADDR: OVERRUN Mask */

#define ADC_ADDR_RSLT_Pos       0                                 /*!< ADC_T::ADDR: RSLT Position */
#define ADC_ADDR_RSLT_Msk       (0xFFFFul << ADC_ADDR_RSLT_Pos)   /*!< ADC_T::ADDR: RSLT Mask */

/* ADCR Bit Field Definitions */
#define ADC_ADCR_DMOF_Pos       31                                /*!< ADC_T::ADCR: DMOF Position */
#define ADC_ADCR_DMOF_Msk       (1ul << ADC_ADCR_DMOF_Pos)        /*!< ADC_T::ADCR: DMOF Mask */

