MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/M054ZDN/mcu.h
} I2C_T;



/** @addtogroup I2C_CONST I2C Bit Field Definition
  Constant Definitions for I2C Controller
  @{
 */

/* I2C I2CON Bit Field Definitions */
#define I2C_I2CON_EI_Pos                        7                                       /*!< I2C_T::I2CON: EI Position */
#define I2C_I2CON_EI_Msk                        (1ul << I2C_I2CON_EI_Pos)               /*!< I2C_T::I2CON: EI Mask */

#define I2C_I2CON_ENS1_Pos                      6                                       /*!< I2C_T::I2CON: ENS1 Position */
#define I2C_I2CON_ENS1_Msk                      (1ul << I2C_I2CON_ENS1_Pos)             /*!< I2C_T::I2CON: ENS1 Mask */

#define I2C_I2CON_STA_Pos                       5                                       /*!< I2C_T::I2CON: STA Position */
#define I2C_I2CON_STA_Msk                       (1ul << I2C_I2CON_STA_Pos)              /*!< I2C_T::I2CON: STA Mask */

#define I2C_I2CON_STO_Pos                       4                                       /*!< I2C_T::I2CON: STO Position */
#define I2C_I2CON_STO_Msk                       (1ul << I2C_I2CON_STO_Pos)              /*!< I2C_T::I2CON: STO Mask */

#define I2C_I2CON_SI_Pos                        3                                       /*!< I2C_T::I2CON: SI Position */
#define I2C_I2CON_SI_Msk                        (1ul << I2C_I2CON_SI_Pos)               /*!< I2C_T::I2CON: SI Mask */

#define I2C_I2CON_AA_Pos                        2                                       /*!< I2C_T::I2CON: AA Position */
#define I2C_I2CON_AA_Msk                        (1ul << I2C_I2CON_AA_Pos)               /*!< I2C_T::I2CON: AA Mask */

/* I2C I2CADDR Bit Field Definitions */
#define I2C_I2CADDR_I2CADDR_Pos                 1                                       /*!< I2C_T::I2CADDR1: I2CADDR Position */
#define I2C_I2CADDR_I2CADDR_Msk                 (0x7Ful << I2C_I2CADDR_I2CADDR_Pos)     /*!< I2C_T::I2CADDR1: I2CADDR Mask */

#define I2C_I2CADDR_GC_Pos                      0                                       /*!< I2C_T::I2CADDR1: GC Position */
#define I2C_I2CADDR_GC_Msk                      (1ul << I2C_I2CADDR_GC_Pos)             /*!< I2C_T::I2CADDR1: GC Mask */

/* I2C I2CDAT Bit Field Definitions */
#define I2C_I2CDAT_I2CDAT_Pos                   0                                       /*!< I2C_T::I2CDAT: I2CDAT Position */
#define I2C_I2CDAT_I2CDAT_Msk                   (0xFFul << I2C_I2CDAT_I2CDAT_Pos)       /*!< I2C_T::I2CDAT: I2CDAT Mask */

/* I2C I2CSTATUS Bit Field Definitions */
#define I2C_I2CSTATUS_I2CSTATUS_Pos             0                                       /*!< I2C_T::I2CSTATUS: I2CSTATUS Position */
#define I2C_I2CSTATUS_I2CSTATUS_Msk             (0xFFul << I2C_I2CSTATUS_I2CSTATUS_Pos) /*!< I2C_T::I2CSTATUS: I2CSTATUS Mask */

/* I2C I2CLK Bit Field Definitions */
#define I2C_I2CLK_I2CLK_Pos                     0                                       /*!< I2C_T::I2CLK: I2CLK Position */
#define I2C_I2CLK_I2CLK_Msk                     (0xFFul << I2C_I2CLK_I2CLK_Pos)         /*!< I2C_T::I2CLK: I2CLK Mask */

/* I2C I2CTOC Bit Field Definitions */
#define I2C_I2CTOC_ENTI_Pos                     2                                       /*!< I2C_T::I2CTOC: ENTI Position */
#define I2C_I2CTOC_ENTI_Msk                     (1ul << I2C_I2CTOC_ENTI_Pos)            /*!< I2C_T::I2CTOC: ENTI Mask */

#define I2C_I2CTOC_DIV4_Pos                     1                                       /*!< I2C_T::I2CTOC: DIV4 Position */
#define I2C_I2CTOC_DIV4_Msk                     (1ul << I2C_I2CTOC_DIV4_Pos)            /*!< I2C_T::I2CTOC: DIV4 Mask */

#define I2C_I2CTOC_TIF_Pos                      0                                       /*!< I2C_T::I2CTOC: TIF Position */
#define I2C_I2CTOC_TIF_Msk                      (1ul << I2C_I2CTOC_TIF_Pos)             /*!< I2C_T::I2CTOC: TIF Mask */

/* I2C I2CADM Bit Field Definitions */
#define I2C_I2CADM_I2CADM_Pos                   1                                       /*!< I2C_T::I2CADM0: I2CADM Position */
#define I2C_I2CADM_I2CADM_Msk                   (0x7Ful << I2C_I2CADM_I2CADM_Pos)       /*!< I2C_T::I2CADM0: I2CADM Mask */

/* I2C I2CWKUPCON Bit Field Definitions */
#define I2C_I2CWKUPCON_WKUPEN_Pos               0                                       /*!< I2C_T::I2CWKUPCON: WKUPEN Position */
#define I2C_I2CWKUPCON_WKUPEN_Msk               (1ul << I2C_I2CWKUPCON_WKUPEN_Pos)      /*!< I2C_T::I2CWKUPCON: WKUPEN Mask */

/* I2C I2CWKUPSTS Bit Field Definitions */
#define I2C_I2CWKUPSTS_WKUPIF_Pos               0                                       /*!< I2C_T::I2CWKUPSTS: WKUPIF Position */
#define I2C_I2CWKUPSTS_WKUPIF_Msk               (1ul << I2C_I2CWKUPSTS_WKUPIF_Pos)      /*!< I2C_T::I2CWKUPSTS: WKUPIF Mask */

/**@}*/ /* I2C_CONST */
/**@}*/ /* I2C */



/*----------------------------- PWM Controller -------------------------------*/

/** @addtogroup PWM PWM Controller(PWM)
  Memory Mapped Structure for PWM Generator and Capture Timer
  @{
 */

typedef struct
{


/**
 * @var PWM_T::PPR
 * Offset: 0x00  PWM Pre-Scale Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |CP01      |Clock pre-scalar 0(PWM counter 0 & 1 for group A and PWM counter 4 & 5 for group B)
 * |        |          |Clock input is divided by (CP01 + 1) before it is fed to the corresponding PWM counter
 * |        |          |If CP01=0, then the pre-scalar 0 output clock will be stopped. So corresponding PWM
 * |        |          |counter will be stopped also.
 * |[15:8]  |CP23      |Clock pre-scalar 2(PWM counter 2 & 3 for group A and PWM counter 6 & 7 for group B)
 * |        |          |Clock input is divided by (CP23 + 1) before it is fed to the corresponding PWM counter
 * |        |          |If CP23=0, then the pre-scalar 2 output clock will be stopped. So corresponding PWM
 * |        |          |counter will be stopped also.
 * |[23:16] |DZI01     |Dead zone interval register for pair of channel 0 and channel 1(PWM0 and PWM1 pair
 * |        |          |for PWM group A, PWM4 and PWM5 pair for PWM group B)
 * |        |          |These 8 bits determine dead zone length.
 * |        |          |The unit time of dead zone length is received from corresponding CSR bits.
 * |[31:24] |DZI23     |Dead zone interval register for pair of channel 2 and channel 3(PWM2 and PWM3 pair
 * |        |          |for PWM group A, PWM6 and PWM7 pair for PWM group B)
 * |        |          |These 8 bits determine dead zone length.
 * |        |          |The unit time of dead zone length is received from corresponding CSR bits.
 * @var PWM_T::CSR
 * Offset: 0x04  PWM Clock Source Divider Select Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |CSR0      |Timer 0 Clock Source Selection(PWM timer 0 for group A and PWM timer 4 for group B)
 * |        |          |Select clock input for timer.
 * |        |          |(Table is the same as CSR3)
 * |[6:4]   |CSR1      |Timer 1 Clock Source Selection(PWM timer 1 for group A and PWM timer 5 for group B)
 * |        |          |Select clock input for timer.
 * |        |          |(Table is the same as CSR3)
 * |[10:8]  |CSR2      |Timer 2 Clock Source Selection(PWM timer 2 for group A and PWM timer 6 for group B)
 * |        |          |Select clock input for timer.
 * |        |          |(Table is the same as CSR3)
 * |[14:12] |CSR3      |Timer 3 Clock Source Selection (PWM timer 3 for group A and PWM timer 7 for group B)
 * |        |          |Select clock input for timer.
 * |        |          |CSRx[2:0] = Input clock divider
 * |        |          |100 = 1
 * |        |          |011 = 16
 * |        |          |010 = 8
 * |        |          |001 = 4
 * |        |          |000 = 2
 * @var PWM_T::PCR
 * Offset: 0x08  PWM Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |CH0EN     |PWM-Timer 0 Enable/Disable Start Run (PWM timer 0 for group A and PWM timer 4 for group B)
 * |        |          |1 = Enable corresponding PWM-Timer Start Run
 * |        |          |0 = Stop corresponding PWM-Timer Running
 * |[2]     |CH0INV    |PWM-Timer 0 Output Inverter ON/OFF(PWM timer 0 for group A and PWM timer 4 for group B)
 * |        |          |1 = Inverter ON
 * |        |          |0 = Inverter OFF
 * |[3]     |CH0MOD    |PWM-Timer 0 Auto-reload/One-Shot Mode(PWM timer 0 for group A and PWM timer 4
 * |        |          |for group B)
 * |        |          |1 = Auto-reload Mode
 * |        |          |0 = One-Shot Mode
 * |        |          |Note: If there is a rising transition at this bit, it will cause CNR0 and CMR0 be clear.
 * |[4]     |DZEN01    |Dead-Zone 0 Generator Enable/Disable(PWM0 and PWM1 pair for PWM group A,
 * |        |          |PWM4 and PWM5 pair for PWM group B)
 * |        |          |1 = Enable
 * |        |          |0 = Disable
 * |        |          |Note: When Dead-Zone Generator is enabled, the pair of PWM0 and PWM1 becomes a
 * |        |          |complementary pair for PWM group A and the pair of PWM4 and PWM5 becomes a
 * |        |          |complementary pair for PWM group B.
 * |[5]     |DZEN23    |Dead-Zone 2 Generator Enable/Disable(PWM2 and PWM3 pair for PWM group A,
 * |        |          |PWM6 and PWM7 pair for PWM group B)
 * |        |          |1 = Enable
 * |        |          |0 = Disable
 * |        |          |Note: When Dead-Zone Generator is enabled, the pair of PWM2 and PWM3 becomes a
 * |        |          |complementary pair for PWM group A and the pair of PWM6 and PWM7 becomes a
 * |        |          |complementary pair for PWM group B.
 * |[8]     |CH1EN     |PWM-Timer 1 Enable/Disable Start Run (PWM timer 1 for group A and PWM timer 5 for
 * |        |          |group B)
 * |        |          |1 = Enable corresponding PWM-Timer Start Run
 * |        |          |0 = Stop corresponding PWM-Timer Running
 * |[10]    |CH1INV    |PWM-Timer 1 Output Inverter ON/OFF(PWM timer 1 for group A and PWM timer 5 for
 * |        |          |group B)
 * |        |          |1 = Inverter ON
 * |        |          |0 = Inverter OFF
 * |[11]    |CH1MOD    |PWM-Timer 1 Auto-reload/One-Shot Mode(PWM timer 1 for group A and PWM timer 5
 * |        |          |for group B)
 * |        |          |1 = Auto-reload Mode
 * |        |          |0 = One-Shot Mode
 * |        |          |Note: If there is a rising transition at this bit, it will cause CNR1 and CMR1 be clear.
 * |[16]    |CH2EN     |PWM-Timer 2 Enable/Disable Start Run (PWM timer 2 for group A and PWM timer 6 for
 * |        |          |group B)
 * |        |          |1 = Enable corresponding PWM-Timer Start Run
 * |        |          |0 = Stop corresponding PWM-Timer Running
 * |[18]    |CH2INV    |PWM-Timer 2 Output Inverter ON/OFF(PWM timer 2 for group A and PWM timer 6 for
 * |        |          |group B)
 * |        |          |1 = Inverter ON
 * |        |          |0 = Inverter OFF
 * |[19]    |CH2MOD    |PWM-Timer 2 Auto-reload/One-Shot Mode(PWM timer 2 for group A and PWM timer 6
 * |        |          |for group B)
 * |        |          |1 = Auto-reload Mode
 * |        |          |0 = One-Shot Mode
 * |        |          |Note: If there is a rising transition at this bit, it will cause CNR2 and CMR2 be clear.
 * |[24]    |CH3EN     |PWM-Timer 3 Enable/Disable Start Run (PWM timer 3 for group A and PWM timer 7 for
 * |        |          |group B)
 * |        |          |1 = Enable corresponding PWM-Timer Start Run
 * |        |          |0 = Stop corresponding PWM-Timer Running
 * |[26]    |CH3INV    |PWM-Timer 3 Output Inverter ON/OFF(PWM timer 3 for group A and PWM timer 7 for
 * |        |          |group B)
 * |        |          |1 = Inverter ON
 * |        |          |0 = Inverter OFF
 * |[27]    |CH3MOD    |PWM-Timer 3 Auto-reload/One-Shot Mode(PWM timer 3 for group A and PWM timer 7
 * |        |          |for group B)
 * |        |          |1 = Auto-reload Mode
 * |        |          |0 = One-Shot Mode
 * |        |          |Note: If there is a rising transition at this bit, it will cause CNR3 and CMR3 be clear.
 * @var PWM_T::CNR0
 * Offset: 0x0C  PWM Counter 0/Timer 0 Loaded Value
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CNR       |PWM Counter/Timer Loaded Value
 * |        |          |CNR determines the PWM period.
 * |        |          |PWM frequency = PWMxy_CLK/(prescale+1)/(clock divider)/(CNR+1); where xy, could be 01, 23,
 * |        |          |45 or 67, depends on selected PWM channel.
 * |        |          |Duty ratio = (CMR+1)/(CNR+1).
 * |        |          |CMR >= CNR: PWM output is always high.
 * |        |          |CMR < CNR: PWM low width = (CNR-CMR) unit; PWM high width = (CMR+1) unit.
 * |        |          |CMR = 0: PWM low width = (CNR) unit; PWM high width = 1 unit
 * |        |          |(Unit = one PWM clock cycle)
 * |        |          |Note: Any write to CNR will take effect in next PWM cycle.
 * @var PWM_T::CMR0
 * Offset: 0x10  PWM Comparator 0 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CMR       |PWM Comparator Register
 * |        |          |CNR determines the PWM duty.
 * |        |          |PWM frequency = PWMxy_CLK/(prescale+1)/(clock divider)/(CNR+1); where xy, could be 01, 23,
 * |        |          |45 or 67, depends on selected PWM channel.
 * |        |          |Duty ratio = (CMR+1)/(CNR+1).
 * |        |          |CMR >= CNR: PWM output is always high.
 * |        |          |CMR < CNR: PWM low width = (CNR-CMR) unit; PWM high width = (CMR+1) unit.
 * |        |          |CMR = 0: PWM low width = (CNR) unit; PWM high width = 1 unit
 * |        |          |(Unit = one PWM clock cycle)
 * |        |          |Note: Any write to CNR will take effect in next PWM cycle.
 * @var PWM_T::PDR0
 * Offset: 0x14  PWM Data 0 Register(current counter 0 value)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |PDR       |PWM Data Register
 * |        |          |User can monitor PDR to know the current value in 16-bit down counter.
 * @var PWM_T::CNR1
 * Offset: 0x18  PWM Counter 1/Timer 1 Loaded Value
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CNR       |PWM Counter/Timer Loaded Value
 * |        |          |CNR determines the PWM period.
 * |        |          |PWM frequency = PWMxy_CLK/(prescale+1)/(clock divider)/(CNR+1); where xy, could be 01, 23,
 * |        |          |45 or 67, depends on selected PWM channel.
 * |        |          |Duty ratio = (CMR+1)/(CNR+1).
 * |        |          |CMR >= CNR: PWM output is always high.
 * |        |          |CMR < CNR: PWM low width = (CNR-CMR) unit; PWM high width = (CMR+1) unit.
 * |        |          |CMR = 0: PWM low width = (CNR) unit; PWM high width = 1 unit
 * |        |          |(Unit = one PWM clock cycle)
 * |        |          |Note: Any write to CNR will take effect in next PWM cycle.
 * @var PWM_T::CMR1
 * Offset: 0x1C  PWM Comparator 1 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CMR       |PWM Comparator Register
 * |        |          |CNR determines the PWM duty.
 * |        |          |PWM frequency = PWMxy_CLK/(prescale+1)/(clock divider)/(CNR+1); where xy, could be 01, 23,
 * |        |          |45 or 67, depends on selected PWM channel.
 * |        |          |Duty ratio = (CMR+1)/(CNR+1).
 * |        |          |CMR >= CNR: PWM output is always high.
 * |        |          |CMR < CNR: PWM low width = (CNR-CMR) unit; PWM high width = (CMR+1) unit.
 * |        |          |CMR = 0: PWM low width = (CNR) unit; PWM high width = 1 unit
 * |        |          |(Unit = one PWM clock cycle)
 * |        |          |Note: Any write to CNR will take effect in next PWM cycle.
 * @var PWM_T::PDR1
 * Offset: 0x20  PWM Data 1 Register(current counter 1 value)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |PDR       |PWM Data Register
 * |        |          |User can monitor PDR to know the current value in 16-bit down counter.
 * @var PWM_T::CNR2
 * Offset: 0x24  PWM Counter 2/Timer 2 Loaded Value
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CNR       |PWM Counter/Timer Loaded Value
 * |        |          |CNR determines the PWM period.
 * |        |          |PWM frequency = PWMxy_CLK/(prescale+1)/(clock divider)/(CNR+1); where xy, could be 01, 23,
 * |        |          |45 or 67, depends on selected PWM channel.
 * |        |          |Duty ratio = (CMR+1)/(CNR+1).
 * |        |          |CMR >= CNR: PWM output is always high.
 * |        |          |CMR < CNR: PWM low width = (CNR-CMR) unit; PWM high width = (CMR+1) unit.
 * |        |          |CMR = 0: PWM low width = (CNR) unit; PWM high width = 1 unit
 * |        |          |(Unit = one PWM clock cycle)
 * |        |          |Note: Any write to CNR will take effect in next PWM cycle.
 * @var PWM_T::CMR2
 * Offset: 0x28  PWM Comparator 2 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CMR       |PWM Comparator Register
 * |        |          |CNR determines the PWM duty.
 * |        |          |PWM frequency = PWMxy_CLK/(prescale+1)/(clock divider)/(CNR+1); where xy, could be 01, 23,
 * |        |          |45 or 67, depends on selected PWM channel.
 * |        |          |Duty ratio = (CMR+1)/(CNR+1).
 * |        |          |CMR >= CNR: PWM output is always high.
 * |        |          |CMR < CNR: PWM low width = (CNR-CMR) unit; PWM high width = (CMR+1) unit.
 * |        |          |CMR = 0: PWM low width = (CNR) unit; PWM high width = 1 unit
 * |        |          |(Unit = one PWM clock cycle)
 * |        |          |Note: Any write to CNR will take effect in next PWM cycle.
 * @var PWM_T::PDR2
 * Offset: 0x2C  PWM Data 2 Register(current counter 2 value)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |PDR       |PWM Data Register
 * |        |          |User can monitor PDR to know the current value in 16-bit down counter.
 * @var PWM_T::CNR3
 * Offset: 0x30  PWM Counter 3/Timer 3 Loaded Value
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CNR       |PWM Counter/Timer Loaded Value
 * |        |          |CNR determines the PWM period.
 * |        |          |PWM frequency = PWMxy_CLK/(prescale+1)/(clock divider)/(CNR+1); where xy, could be 01, 23,
 * |        |          |45 or 67, depends on selected PWM channel.
 * |        |          |Duty ratio = (CMR+1)/(CNR+1).
 * |        |          |CMR >= CNR: PWM output is always high.
 * |        |          |CMR < CNR: PWM low width = (CNR-CMR) unit; PWM high width = (CMR+1) unit.
 * |        |          |CMR = 0: PWM low width = (CNR) unit; PWM high width = 1 unit
 * |        |          |(Unit = one PWM clock cycle)
 * |        |          |Note: Any write to CNR will take effect in next PWM cycle.
 * @var PWM_T::CMR3
 * Offset: 0x34  PWM Comparator 3 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CMR       |PWM Comparator Register
 * |        |          |CNR determines the PWM duty.
 * |        |          |PWM frequency = PWMxy_CLK/(prescale+1)/(clock divider)/(CNR+1); where xy, could be 01, 23,
 * |        |          |45 or 67, depends on selected PWM channel.
 * |        |          |Duty ratio = (CMR+1)/(CNR+1).
 * |        |          |CMR >= CNR: PWM output is always high.
 * |        |          |CMR < CNR: PWM low width = (CNR-CMR) unit; PWM high width = (CMR+1) unit.
 * |        |          |CMR = 0: PWM low width = (CNR) unit; PWM high width = 1 unit
 * |        |          |(Unit = one PWM clock cycle)
 * |        |          |Note: Any write to CNR will take effect in next PWM cycle.
 * @var PWM_T::PDR3
 * Offset: 0x38  PWM Data 3 Register(current counter 3 value)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |PDR       |PWM Data Register
 * |        |          |User can monitor PDR to know the current value in 16-bit down counter.
 * @var PWM_T::PIER
 * Offset: 0x40  PWM Interrupt Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |PWMIE0    |PWM channel 0 Interrupt Enable
 * |        |          |1 = Enable
 * |        |          |0 = Disable
 * |[1]     |PWMIE1    |PWM channel 1 Interrupt Enable
 * |        |          |1 = Enable
 * |        |          |0 = Disable
 * |[2]     |PWMIE2    |PWM channel 2 Interrupt Enable
 * |        |          |1 = Enable
 * |        |          |0 = Disable
 * |[3]     |PWMIE3    |PWM channel 3 Interrupt Enable
 * |        |          |1 = Enable
 * |        |          |0 = Disable
 * @var PWM_T::PIIR
 * Offset: 0x44  PWM Interrupt Indication Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |PWMIF0    |PWM channel 0 Interrupt Status
 * |        |          |Flag is set by hardware when PWM0 down counter reaches zero, software can clear this
 * |        |          |bit by writing a one to it.
 * |[1]     |PWMIF1    |PWM channel 1 Interrupt Status
 * |        |          |Flag is set by hardware when PWM1 down counter reaches zero, software can clear this
 * |        |          |bit by writing a one to it.
 * |[2]     |PWMIF2    |PWM channel 2 Interrupt Status
 * |        |          |Flag is set by hardware when PWM2 down counter reaches zero, software can clear this
 * |        |          |bit by writing a one to it.
 * |[3]     |PWMIF3    |PWM channel 3 Interrupt Status
 * |        |          |Flag is set by hardware when PWM3 down counter reaches zero, software can clear this
 * |        |          |bit by writing a one to it.
 * @var PWM_T::CCR0
 * Offset: 0x50  Capture 0/1 Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |INV0      |PWM Group Channel 0 Inverter ON/OFF
 * |        |          |1 = Inverter ON. Reverse the input signal from GPIO before fed to Capture timer
 * |        |          |0 = Inverter OFF
