MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/M054ZDN/mcu.h
 * |        |          |0 = PWM3 synchronous start disable.
 * |        |          |If this bit is set to 1, PWM-Timer3 will synchronous start with PWM-Timer0 when SW writes 1 to PCR.CH0EN in PWM group A.
 */

    __IO uint32_t PPR;           /* Offset: 0x00  PWM Pre-Scale Register                                             */
    __IO uint32_t CSR;           /* Offset: 0x04  PWM Clock Source Divider Select Register                           */
    __IO uint32_t PCR;           /* Offset: 0x08  PWM Control Register                                               */
    __IO uint32_t CNR0;          /* Offset: 0x0C  PWM Counter 0/Timer 0 Loaded Value                                 */
    __IO uint32_t CMR0;          /* Offset: 0x10  PWM Comparator 0 Register                                          */
    __I  uint32_t PDR0;          /* Offset: 0x14  PWM Data 0 Register(current counter 0 value)                       */
    __IO uint32_t CNR1;          /* Offset: 0x18  PWM Counter 1/Timer 1 Loaded Value                                 */
    __IO uint32_t CMR1;          /* Offset: 0x1C  PWM Comparator 1 Register                                          */
    __I  uint32_t PDR1;          /* Offset: 0x20  PWM Data 1 Register(current counter 1 value)                       */
    __IO uint32_t CNR2;          /* Offset: 0x24  PWM Counter 2/Timer 2 Loaded Value                                 */
    __IO uint32_t CMR2;          /* Offset: 0x28  PWM Comparator 2 Register                                          */
    __I  uint32_t PDR2;          /* Offset: 0x2C  PWM Data 2 Register(current counter 2 value)                       */
    __IO uint32_t CNR3;          /* Offset: 0x30  PWM Counter 3/Timer 3 Loaded Value                                 */
    __IO uint32_t CMR3;          /* Offset: 0x34  PWM Comparator 3 Register                                          */
    __I  uint32_t PDR3;          /* Offset: 0x38  PWM Data 3 Register(current counter 3 value)                       */
    __I  uint32_t RESERVE0;
    __IO uint32_t PIER;          /* Offset: 0x40  PWM Interrupt Enable Register                                      */
    __IO uint32_t PIIR;          /* Offset: 0x44  PWM Interrupt Indication Register                                  */
    __I  uint32_t RESERVE1[2];
    __IO uint32_t CCR0;          /* Offset: 0x50  Capture 0/1 Control Register                                       */
    __IO uint32_t CCR2;          /* Offset: 0x54  Capture 2/3 Control Register                                       */
    __IO uint32_t CRLR0;         /* Offset: 0x58  Capture 0 Rising Latch Register                                    */
    __IO uint32_t CFLR0;         /* Offset: 0x5C  Capture 0 Falling Latch Register                                   */
    __IO uint32_t CRLR1;         /* Offset: 0x60  Capture 1 Rising Latch Register                                    */
    __IO uint32_t CFLR1;         /* Offset: 0x64  Capture 1 Falling Latch Register                                   */
    __IO uint32_t CRLR2;         /* Offset: 0x68  Capture 2 Rising Latch Register                                    */
    __IO uint32_t CFLR2;         /* Offset: 0x6C  Capture 2 Falling Latch Register                                   */
    __IO uint32_t CRLR3;         /* Offset: 0x70  Capture 3 Rising Latch Register                                    */
    __IO uint32_t CFLR3;         /* Offset: 0x74  Capture 3 Falling Latch Register                                   */
    __IO uint32_t CAPENR;        /* Offset: 0x78  Capture Input Enable Register                                      */
    __IO uint32_t POE;           /* Offset: 0x7C  PWM Output Enable Register                                         */
    __IO uint32_t TCON;          /* Offset: 0x80  PWM Trigger Control Register                                       */
    __IO uint32_t TSTATUS;       /* Offset: 0x84  PWM Trigger Status Register                                        */
    __I  uint32_t RESERVE2[4];
    __IO uint32_t PSCR;          /* Offset: 0x98  PWM Synchronous Control Register                                   */

} PWM_T;



/** @addtogroup PWM_CONST PWM Bit Field Definition
  Constant Definitions for PWM Controller
  @{
 */

/* PWM PPR Bit Field Definitions */
#define PWM_PPR_DZI23_Pos                       24                                  /*!< PWM_T::PPR: DZI23 Position */
#define PWM_PPR_DZI23_Msk                       (0xFFul << PWM_PPR_DZI23_Pos)       /*!< PWM_T::PPR: DZI23 Mask */

#define PWM_PPR_DZI01_Pos                       16                                  /*!< PWM_T::PPR: DZI01 Position */
#define PWM_PPR_DZI01_Msk                       (0xFFul << PWM_PPR_DZI01_Pos)       /*!< PWM_T::PPR: DZI01 Mask */

#define PWM_PPR_CP23_Pos                        8                                   /*!< PWM_T::PPR: CP23 Position */
#define PWM_PPR_CP23_Msk                        (0xFFul << PWM_PPR_CP23_Pos)        /*!< PWM_T::PPR: CP23 Mask */

#define PWM_PPR_CP01_Pos                        0                                   /*!< PWM_T::PPR: CP01 Position */
#define PWM_PPR_CP01_Msk                        (0xFFul << PWM_PPR_CP01_Pos)        /*!< PWM_T::PPR: CP01 Mask */

/* PWM CSR Bit Field Definitions */
#define PWM_CSR_CSR3_Pos                        12                                  /*!< PWM_T::CSR: CSR3 Position */
#define PWM_CSR_CSR3_Msk                        (7ul << PWM_CSR_CSR3_Pos)           /*!< PWM_T::CSR: CSR3 Mask */

#define PWM_CSR_CSR2_Pos                        8                                   /*!< PWM_T::CSR: CSR2 Position */
#define PWM_CSR_CSR2_Msk                        (7ul << PWM_CSR_CSR2_Pos)           /*!< PWM_T::CSR: CSR2 Mask */

#define PWM_CSR_CSR1_Pos                        4                                   /*!< PWM_T::CSR: CSR1 Position */
#define PWM_CSR_CSR1_Msk                        (7ul << PWM_CSR_CSR1_Pos)           /*!< PWM_T::CSR: CSR1 Mask */

#define PWM_CSR_CSR0_Pos                        0                                   /*!< PWM_T::CSR: CSR0 Position */
#define PWM_CSR_CSR0_Msk                        (7ul << PWM_CSR_CSR0_Pos)           /*!< PWM_T::CSR: CSR0 Mask */

/* PWM PCR Bit Field Definitions */
#define PWM_PCR_PWM23TYPE_Pos                   31                                  /*!< PWM_T::PCR: PWM23TYPE Position */
#define PWM_PCR_PWM23TYPE_Msk                   (1ul << PWM_PCR_PWM23TYPE_Pos)      /*!< PWM_T::PCR: PWM23TYPE Mask */

#define PWM_PCR_PWM01TYPE_Pos                   30                                  /*!< PWM_T::PCR: PWM01TYPE Position */
#define PWM_PCR_PWM01TYPE_Msk                   (1ul << PWM_PCR_PWM01TYPE_Pos)      /*!< PWM_T::PCR: PWM01TYPE Mask */

#define PWM_PCR_CH3MOD_Pos                      27                                  /*!< PWM_T::PCR: CH3MOD Position */
#define PWM_PCR_CH3MOD_Msk                      (1ul << PWM_PCR_CH3MOD_Pos)         /*!< PWM_T::PCR: CH3MOD Mask */

#define PWM_PCR_CH3INV_Pos                      26                                  /*!< PWM_T::PCR: CH3INV Position */
#define PWM_PCR_CH3INV_Msk                      (1ul << PWM_PCR_CH3INV_Pos)         /*!< PWM_T::PCR: CH3INV Mask */

#define PWM_PCR_CH3PINV_Pos                     25                                  /*!< PWM_T::PCR: CH3PINV Position */
#define PWM_PCR_CH3PINV_Msk                     (1ul << PWM_PCR_CH3PINV_Pos)        /*!< PWM_T::PCR: CH3PINV Mask */

