MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/M054ZDN/mcu.h
/* PWM TCON Bit Field Definitions */
#define PWM_TCON_PWM3DTEN_Pos                   11                                  /*!< PWM_T::TCON: PWM3DTEN Position */
#define PWM_TCON_PWM3DTEN_Msk                   (1ul << PWM_TCON_PWM3DTEN_Pos)      /*!< PWM_T::TCON: PWM3DTEN Mask */

#define PWM_TCON_PWM2DTEN_Pos                   10                                  /*!< PWM_T::TCON: PWM2DTEN Position */
#define PWM_TCON_PWM2DTEN_Msk                   (1ul << PWM_TCON_PWM2DTEN_Pos)      /*!< PWM_T::TCON: PWM2DTEN Mask */

#define PWM_TCON_PWM1DTEN_Pos                   9                                   /*!< PWM_T::TCON: PWM1DTEN Position */
#define PWM_TCON_PWM1DTEN_Msk                   (1ul << PWM_TCON_PWM1DTEN_Pos)      /*!< PWM_T::TCON: PWM1DTEN Mask */

#define PWM_TCON_PWM0DTEN_Pos                   8                                   /*!< PWM_T::TCON: PWM0DTEN Position */
#define PWM_TCON_PWM0DTEN_Msk                   (1ul << PWM_TCON_PWM0DTEN_Pos)      /*!< PWM_T::TCON: PWM0DTEN Mask */

#define PWM_TCON_PWM3TEN_Pos                    3                                   /*!< PWM_T::TCON: PWM3TEN Position */
#define PWM_TCON_PWM3TEN_Msk                    (1ul << PWM_TCON_PWM3TEN_Pos)       /*!< PWM_T::TCON: PWM3TEN Mask */

#define PWM_TCON_PWM2TEN_Pos                    2                                   /*!< PWM_T::TCON: PWM2TEN Position */
#define PWM_TCON_PWM2TEN_Msk                    (1ul << PWM_TCON_PWM2TEN_Pos)       /*!< PWM_T::TCON: PWM2TEN Mask */

#define PWM_TCON_PWM1TEN_Pos                    1                                   /*!< PWM_T::TCON: PWM1TEN Position */
#define PWM_TCON_PWM1TEN_Msk                    (1ul << PWM_TCON_PWM1TEN_Pos)       /*!< PWM_T::TCON: PWM1TEN Mask */

#define PWM_TCON_PWM0TEN_Pos                    0                                   /*!< PWM_T::TCON: PWM0TEN Position */
#define PWM_TCON_PWM0TEN_Msk                    (1ul << PWM_TCON_PWM0TEN_Pos)       /*!< PWM_T::TCON: PWM0TEN Mask */

/* PWM TSTATUS Bit Field Definitions */
#define PWM_TSTATUS_PWM3TF_Pos                  3                                   /*!< PWM_T::TSTATUS: PWM3TF Position */
#define PWM_TSTATUS_PWM3TF_Msk                  (1ul << PWM_TSTATUS_PWM3TF_Pos)     /*!< PWM_T::TSTATUS: PWM3TF Mask */

#define PWM_TSTATUS_PWM2TF_Pos                  2                                   /*!< PWM_T::TSTATUS: PWM2TF Position */
#define PWM_TSTATUS_PWM2TF_Msk                  (1ul << PWM_TSTATUS_PWM2TF_Pos)     /*!< PWM_T::TSTATUS: PWM2TF Mask */

#define PWM_TSTATUS_PWM1TF_Pos                  1                                   /*!< PWM_T::TSTATUS: PWM1TF Position */
#define PWM_TSTATUS_PWM1TF_Msk                  (1ul << PWM_TSTATUS_PWM1TF_Pos)     /*!< PWM_T::TSTATUS: PWM1TF Mask */

#define PWM_TSTATUS_PWM0TF_Pos                  0                                   /*!< PWM_T::TSTATUS: PWM0TF Position */
#define PWM_TSTATUS_PWM0TF_Msk                  (1ul << PWM_TSTATUS_PWM0TF_Pos)     /*!< PWM_T::TSTATUS: PWM0TF Mask */

/* PWM PSCR Bit Field Definitions */
#define PWM_PSCR_PSSEN3_Pos                     24                                  /*!< PWM_T::PSCR: PSSEN3 Position */
#define PWM_PSCR_PSSEN3_Msk                     (1ul << PWM_PSCR_PSSEN3_Pos)        /*!< PWM_T::PSCR: PSSEN3 Mask */

#define PWM_PSCR_PSSEN2_Pos                     16                                  /*!< PWM_T::PSCR: PSSEN2 Position */
#define PWM_PSCR_PSSEN2_Msk                     (1ul << PWM_PSCR_PSSEN2_Pos)        /*!< PWM_T::PSCR: PSSEN2 Mask */

#define PWM_PSCR_PSSEN1_Pos                     8                                   /*!< PWM_T::PSCR: PSSEN1 Position */
#define PWM_PSCR_PSSEN1_Msk                     (1ul << PWM_PSCR_PSSEN1_Pos)        /*!< PWM_T::PSCR: PSSEN1 Mask */

#define PWM_PSCR_PSSEN0_Pos                     0                                   /*!< PWM_T::PSCR: PSSEN0 Position */
#define PWM_PSCR_PSSEN0_Msk                     (1ul << PWM_PSCR_PSSEN0_Pos)        /*!< PWM_T::PSCR: PSSEN0 Mask */
/**@}*/ /* PWM_CONST */
/**@}*/ /* PWM */



/*------------------------- SPI Interface Controller -------------------------*/
/** @addtogroup SPI SPI Controller(SPI)
  Memory Mapped Structure for SPI Controller
  @{
 */

typedef struct
{


/**
 * @var SPI_T::CNTRL
 * Offset: 0x00  SPI Control and Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |GO_BUSY   |SPI Transfer Trigger and Busy Status
 * |        |          |On M05xxBN:
 * |        |          |During the data transfer, this bit keeps the value of 1. As the transfer is finished, this bit
 * |        |          |will be cleared automatically.
 * |        |          |0 = Writing 0 to this bit to stop data transfer if SPI is transferring.
 * |        |          |1 = In Master mode, writing 1 to this bit will start the SPI data transfer; in Slave mode,
 * |        |          |writing 1 to this bit indicates that the slave is ready to communicate with a master.
 * |        |          |Note: All registers should be set before writing 1 to the GO_BUSY bit.
 * |        |          |On M05xxDN/DE:
 * |        |          |In FIFO mode, this bit will be controlled by hardware. Software cannot modify this bit.
 * |        |          |If FIFO mode is disabled, during the data transfer, this bit keeps the value of 1. As the
 * |        |          |transfer is finished, this bit will be cleared automatically.
 * |        |          |0 = Writing 0 to this bit to stop data transfer if SPI is transferring.
 * |        |          |1 = In Master mode, writing 1 to this bit to start the SPI data transfer; in Slave mode,
 * |        |          |writing 1 to this bit indicates that the slave is ready to communicate with a master.
 * |        |          |Note 1: When FIFO mode is disabled, all configurations should be ready before writing
 * |        |          |1 to the GO_BUSY bit.
 * |        |          |Note 2: In M05xxDN/DE SPI Slave mode, if FIFO mode is disabled and the SPI bus
 * |        |          |clock is kept at idle state during a data transfer, the GO_BUSY bit will not be cleared to
 * |        |          |0 when slave select signal goes to inactive state.
 * |[1]     |RX_NEG    |Receive on Negative Edge
 * |        |          |0 = Received data input signal is latched on the rising edge of SPI bus clock.
 * |        |          |1 = Received data input signal is latched on the falling edge of SPI bus clock.
 * |[2]     |TX_NEG    |Transmit on Negative Edge
 * |        |          |0 = Transmitted data output signal is changed on the rising edge of SPI bus clock.
 * |        |          |1 = Transmitted data output signal is changed on the falling edge of SPI bus clock.
 * |[7:3]   |TX_BIT_LEN|Transmit Bit Length
 * |        |          |This field specifies how many bits are transmitted in one transaction.
 * |        |          |The minimum bit length is 8 bits and can up to 32 bits.
 * |        |          |TX_BIT_LEN = 0x08 ... 8 bit
 * |        |          |TX_BIT_LEN = 0x09 ... 9 bits
 * |        |          |......
 * |        |          |TX_BIT_LEN = 0x1f ... 31 bits
 * |        |          |TX_BIT_LEN = 0x00 ... 32 bits
 * |[9:8]   |TX_NUM    |Numbers of Transmit/Receive Word (M05xxBN Only)
 * |        |          |This field specifies how many transmit/receive word numbers should be executed
 * |        |          |in one transfer.
 * |        |          |00 = Only one transmit/receive word will be executed in one transfer.
 * |        |          |01 = Two successive transmit/receive words will be executed in one transfer. (burst mode)
 * |        |          |10 = Reserved.
 * |        |          |11 = Reserved.
 * |        |          |Note: In Slave mode with level-trigger configuration, if TX_NUM is set to 01, the slave
 * |        |          |select pin must be kept at active state during the successive data transfer.
 * |[10]    |LSB       |LSB First
 * |        |          |0 = The MSB is transmitted/received first.
 * |        |          |1 = The LSB is transmitted/received first.
 * |[11]    |CLKP      |Clock Polarity
 * |        |          |0 = SPI bus clock idle low.
 * |        |          |1 = SPI bus clock idle high.
 * |[15:12] |SP_CYCLE  |Suspend Interval (master only)
 * |        |          |These four bits provide configurable suspend interval between two successive
 * |        |          |transactions in a transfer. The definition of the suspend interval is the interval between
 * |        |          |the last clock edge of the preceding transaction word and the first clock edge of the
 * |        |          |following transaction word.
 * |        |          |On M05xxBN:
 * |        |          |The default value is 0x0. When TX_NUM = 00b, setting this field has no effect on
 * |        |          |transfer. The desired suspend interval is obtained according to the following equation:
 * |        |          |For byte suspend interval and burst mode suspend interval:
 * |        |          |(SP_CYCLE[3:0] + 2) * period of SPI bus clock + 1 system clock cycle
 * |        |          |Example:
 * |        |          |SP_CYCLE = 0x0 ... 2 SPI bus clock cycle + 1 system clock cycle
 * |        |          |SP_CYCLE = 0x1 ... 3 SPI bus clock cycle + 1 system clock cycle
 * |        |          |......
 * |        |          |SP_CYCLE = 0xE ... 16 SPI bus clock cycle + 1 system clock cycle
 * |        |          |SP_CYCLE = 0xF ... 17 SPI bus clock cycle + 1 system clock cycle
 * |        |          |If the SPI bus clock rate equals system clock rate, that is to say, the DIV_ONE feature
 * |        |          |is enabled, the burst mode suspend interval period is
 * |        |          |(SP_CYCLE[3:0] * 2 + 3.5) * period of system clock
 * |        |          |On M05xxDN/DE:
 * |        |          |The default value is 0x3. The period of the suspend interval is obtained according
 * |        |          |to the following equation:
 * |        |          |(SP_CYCLE[3:0] + 0.5) * period of SPI bus clock cycle
 * |        |          |Example:
 * |        |          |SP_CYCLE = 0x0 ... 0.5 SPI bus clock cycle
 * |        |          |SP_CYCLE = 0x1 ... 1.5 SPI bus clock cycle
 * |        |          |......
 * |        |          |SP_CYCLE = 0xE ... 14.5 SPI bus clock cycle
 * |        |          |SP_CYCLE = 0xF ... 15.5 SPI bus clock cycle
 * |[16]    |IF        |Unit-Transfer Interrupt Flag
 * |        |          |0 = No transaction has been finished since this bit was cleared to 0.
 * |        |          |1 = SPI controller has finished one unit transfer.
 * |        |          |NOTE: This bit can be cleared by writing 1 to itself.
 * |[17]    |IE        |Unit-Transfer Interrupt Enable Control
 * |        |          |0 = SPI unit-transfer interrupt Disabled.
 * |        |          |1 = SPI unit-transfer interrupt Enabled.
 * |[18]    |SLAVE     |SLAVE Mode Control
 * |        |          |0 = Master mode.
 * |        |          |1 = Slave mode.
 * |[19]    |REORDER   |Byte Reorder Function Selection
 * |        |          |On M05xxBN:
 * |        |          |00 = Disable both byte reorder and byte suspend functions.
 * |        |          |01 = Enable byte reorder function and insert a byte suspend interval (2~17 SPI clock
 * |        |          |cycles) among each byte. The setting of TX_BIT_LEN must be configured as 0x00 (32 bits).
 * |        |          |10 = Enable byte reorder function, but disable byte suspend function.
 * |        |          |11 = Disable byte reorder function, but insert a suspend interval (2~17 SPI clock cycles)
 * |        |          |among each byte. The setting of TX_BIT_LEN must be configured as 0x00 (32 bits).
 * |        |          |Note 1: The byte reorder function is only available if TX_BIT_LEN is defined as 16, 24, and 32 bits.
 * |        |          |Note 2: In Slave mode with level-trigger configuration, if the byte suspend function is enabled,
 * |        |          |the slave select pin must be kept at active state during the successive four bytes transfer.
 * |        |          |On M05xxDN/DE:
 * |        |          |00 = Byte reorder function and byte suspend function are Disabled.
 * |        |          |01 = Byte reorder function Enabled. Byte suspend interval is determined by the setting
 * |        |          |of SP_CYCLE. Set SP_CYCLE to 0 to disabled byte suspend function.
 * |        |          |10 = Reserved.
 * |        |          |11 = Reserved.
 * |        |          |Note: Byte reorder function is only available if TX_BIT_LEN is defined as 16, 24, and 32 bits.
 * |[21]    |FIFO      |FIFO Mode Enable Control (M05xxDN/DE Only)
 * |        |          |0 = FIFO mode Disabled.
 * |        |          |1 = FIFO mode Enabled.
 * |        |          |Note:
 * |        |          |1. Before enabling FIFO mode, the other related settings should be set in advance.
 * |        |          |2. In Master mode, if the FIFO mode is enabled, the GO_BUSY bit will be set to 1
 * |        |          |automatically after writing data to the transmit FIFO buffer; the GO_BUSY bit
 * |        |          |will be cleared to 0 automatically when the SPI controller is in idle.
 * |        |          |If all data stored at transmit FIFO buffer are sent out, the TX_EMPTY bit will be set to 1
 * |        |          |and the GO_BUSY bit will be cleared to 0.
 * |        |          |3. After clearing this bit to 0, user must wait for at least 2 peripheral clock periods
 * |        |          |before setting this bit to 1 again.
 * |[23]    |VARCLK_EN |Variable Clock Enable Control (M05xxBN Master Mode Only)
 * |        |          |0 = The bus clock output frequency is fixed and decided only by the value of DIVIDER.
 * |        |          |1 = The bus clock output frequency is variable. The output frequency is decided by the
 * |        |          |values of VARCLK, DIVIDER, and DIVIDER2.
 * |        |          |Note: When this VARCLK_EN bit is set, the setting of TX_BIT_LEN must be
 * |        |          |programmed as 0x10 (16-bit mode).
 * |[24]    |RX_EMPTY  |Receive FIFO Buffer Empty Indicator (Read Only) (M05xxDN/DE Only)
 * |        |          |A mutual mirror bit of SPI_STATUS[24].
 * |        |          |0 = Receive FIFO buffer is not empty.
 * |        |          |1 = Receive FIFO buffer is empty.
 * |[25]    |RX_FULL   |Receive FIFO Buffer Full Indicator (Read Only) (M05xxDN/DE Only)
 * |        |          |A mutual mirror bit of SPI_STATUS[25].
 * |        |          |0 = Receive FIFO buffer is not full.
 * |        |          |1 = Receive FIFO buffer is full.
 * |[26]    |TX_EMPTY  |Transmit FIFO Buffer Empty Indicator (Read Only) (M05xxDN/DE Only)
 * |        |          |A mutual mirror bit of SPI_STATUS[26].
 * |        |          |0 = Transmit FIFO buffer is not empty.
 * |        |          |1 = Transmit FIFO buffer is empty.
 * |[27]    |TX_FULL   |Transmit FIFO Buffer Full Indicator (Read Only) (M05xxDN/DE Only)
 * |        |          |A mutual mirror bit of SPI_STATUS[27].
 * |        |          |0 = Transmit FIFO buffer is not full.
 * |        |          |1 = Transmit FIFO buffer is full.
 * @var SPI_T::DIVIDER
 * Offset: 0x04  SPI Clock Divider Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |DIVIDER   |Clock Divider
 * |        |          |On M05xxBN:
 * |        |          |Only available in Master mode. The value in this field is the frequency divider to
 * |        |          |determine the master's peripheral clock frequency (f_spi) and the bus clock frequency on the
 * |        |          |SPI bus clock output pin. The desired frequency is obtained according to the following equation:
 * |        |          |f_spi = f_pclk / ((DIVIDER + 1)*2)
 * |        |          |In Slave mode, the period of SPI bus clock driven by a master shall equal or over 5
 * |        |          |times the period of PCLK. In other words, the maximum frequency of SPI bus clock is
 * |        |          |the fifth of the frequency of slave's PCLK.
 * |        |          |On M05xxDN/DE:
 * |        |          |Only DIVIDER[7:0] is available. The value in this field is the frequency divider to
 * |        |          |determine the SPI peripheral clock frequency, f_spi, and the SPI master's bus clock
 * |        |          |frequency on the SPI bus clock output pin. The frequency is obtained according to the
 * |        |          |following equation.
 * |        |          |If the bit of BCn, SPI_CNTRL2[31], is set to 0,
 * |        |          |f_spi = f_SPI_clock_src / ((DIVIDER + 1)*2)
 * |        |          |else if BCn is set to 1,
 * |        |          |f_spi = f_SPI_clock_src / (DIVIDER + 1)
 * |        |          |where f_SPI_clock_src is the SPI peripheral clock source which is defined in the CLKSEL1 register.
 * @var SPI_T::SSR
 * Offset: 0x08  SPI Slave Select Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SSR       |Slave Select Control (Master Only)
 * |        |          |If AUTOSS bit is cleared to 0,
 * |        |          |0 = Set the SPISSx line to inactive state.
 * |        |          |1 = Set the proper SPISSx line to active state.
 * |        |          |If AUTOSS bit is set to 1,
 * |        |          |0 = Keep the SPISSx line at inactive state.
 * |        |          |1 = Select the SPISSx line to be automatically driven to active state for the duration of
 * |        |          |transmission/reception, and will be driven to inactive state for the rest of the time.
 * |        |          |The active state of SPISSx is specified in SS_LVL bit.
 * |[2]     |SS_LVL    |Slave Select Active Level
 * |        |          |This bit defines the active status of slave select signal (SPISSx).
 * |        |          |0 = The slave select signal SPISSx is active at low-level/falling-edge.
 * |        |          |1 = The slave select signal SPISSx is active at high-level/rising-edge.
 * |[3]     |AUTOSS    |Automatic Slave Select (Master only)
 * |        |          |0 = If this bit is cleared, slave select signal will be asserted and de-asserted by setting
 * |        |          |and clearing SSR[0].
 * |        |          |1 = If this bit is set, SPISSx signal is generated automatically. It means that slave
 * |        |          |select signal will be asserted by the SPI controller when transmit/receive is started by
 * |        |          |setting GO_BUSY, and is de-asserted after each transmit/receive is finished.
 * |[4]     |SS_LTRIG  |Slave Select Level Trigger (Slave only)
 * |        |          |0: The input slave select signal is edge-trigger. This is default value. It depends on
 * |        |          |SS_LVL to decide the signal is active at falling-edge or rising-edge.
 * |        |          |1: The slave select signal will be level-trigger. It depends on SS_LVL to decide the
 * |        |          |signal is active low or active high.
 * |[5]     |LTRIG_FLAG|Level Trigger Accomplish Flag
 * |        |          |When the SS_LTRIG bit is set in Slave mode, this bit can be read to indicate the
 * |        |          |received bit number is met the requirement or not.
 * |        |          |0 = The transaction number or the transferred bit length of one transaction does not
 * |        |          |meet the specified requirements.
 * |        |          |1 = The transaction number and the transferred bit length met the specified
 * |        |          |requirements which defined in TX_NUM and TX_BIT_LEN.
 * |        |          |Note: This bit is READ only and only available in Slave mode.
 * @var SPI_T::RX0
 * Offset: 0x10  Data Receive Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |RX        |Data Receive Register
 * |        |          |The Data Receive Registers hold the value of received data of the last executed transfer. The
 * |        |          |number of valid bits depend on the transmit bit length field in the SPI_CNTRL register. For
 * |        |          |example, if TX_BIT_LEN is set to 0x08 and TX_NUM is set to 0x0, bit RX0[7:0] holds the
 * |        |          |received data.
 * |        |          |NOTE: The Data Receive Registers are read only registers.
 * @var SPI_T::RX1
 * Offset: 0x14  Data Receive Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |RX        |Data Receive Register
 * |        |          |The Data Receive Registers hold the value of received data of the last executed transfer. The
 * |        |          |number of valid bits depend on the transmit bit length field in the SPI_CNTRL register. For
 * |        |          |example, if TX_BIT_LEN is set to 0x08 and TX_NUM is set to 0x0, bit RX0[7:0] holds the
 * |        |          |received data.
 * |        |          |NOTE: The Data Receive Registers are read only registers.
 * @var SPI_T::TX0
 * Offset: 0x20  Data Transmit Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |TX        |Data Transmit Register
 * |        |          |The Data Transmit Registers hold the data to be transmitted in the next transfer. The number
 * |        |          |of valid bits depend on the transmit bit length field in the CNTRL register.
 * |        |          |For example, if TX_BIT_LEN is set to 0x08 and the TX_NUM is set to 0x0, the bit TX0[7:0] will be
 * |        |          |transmitted in next transfer. If TX_BIT_LEN is set to 0x00 and TX_NUM is set to 0x1, the core will
 * |        |          |perform two successive 32-bit transmit/receive using the same setting (the order is TX0[31:0], TX1[31:0]).
 * @var SPI_T::TX1
 * Offset: 0x24  Data Transmit Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |TX        |Data Transmit Register
 * |        |          |The Data Transmit Registers hold the data to be transmitted in the next transfer. The number
 * |        |          |of valid bits depend on the transmit bit length field in the CNTRL register.
 * |        |          |For example, if TX_BIT_LEN is set to 0x08 and the TX_NUM is set to 0x0, the bit TX0[7:0] will be
 * |        |          |transmitted in next transfer. If TX_BIT_LEN is set to 0x00 and TX_NUM is set to 0x1, the core will
 * |        |          |perform two successive 32-bit transmit/receive using the same setting (the order is TX0[31:0], TX1[31:0]).
 * @var SPI_T::VARCLK
 * Offset: 0x34  Variable Clock Pattern Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |VARCLK    |Variable Clock Pattern
 * |        |          |The value in this field is the frequency patterns of the SPI bus clock.
 * |        |          |If the bit pattern of VARCLK is 0, the output frequency of SPI bus clock is according the value of DIVIDER.
 * |        |          |If the bit pattern of VARCLK is 1, the output frequency of SPI bus clock is according the value of DIVIDER2.
 * |        |          |If the variable clock function is disabled, this setting is unmeaning.
 * @var SPI_T::CNTRL2
 * Offset: 0x3C  SPI Control and Status Register 2
